fresa.org
# Note: export to HTML using twbs (=,ewh=)

#+title: Fresa, a plant propagation algorithm
#+author:    Professor Eric S Fraga
#+email:     e.fraga@ucl.ac.uk
#+options: num:nil ^:nil toc:t tex:imagemagick

# add extra meta information when tangling the code
#+property: header-args :comments yes

# +HTML_HEAD: <link href=\"https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css\" rel=\"stylesheet\">
#+html: <style type="text/css"> .nav {position: fixed;}</style>
#+HTML_HEAD: <link href="taopeng-notes.css" rel="stylesheet" type="text/css" />
# +html: <style>pre.src:before { display: inline; }</style>

| *Author*        | [[https://www.ucl.ac.uk/~ucecesf/][{{{author}}}]] ([[mailto:e.fraga@ucl.ac.uk?subject=The Fresa plant propagation algorithm][{{{email}}}]])                                  |
| *Last revision* | {{{modification-time(%Y-%m-%d %H:%M:%S,t)}}}                |
| *Latest news*   | API change for =solve= method. See [[version][version information]] below. |

# +toc: headlines 1


* TODO bugs and new features [8/14]                           :noexport:
- consider a dynamic population size for multi-objective optimization problems where \(N_p \gets 2 \times N_{pareto}\) constrained by \(N_p \in [N_{p,\min}, N_{p,\max}]\)
- [ ] It would be interesting to see a plot of the evolution of solutions (e.g. draw vectors from original point to neighbour found).  This could be done for the reactor operation example I presented at IChEAP14 and EGL-B as it has only three values in the decision vector.
- [ ] consider implementing Christopher Taylor's algorithm(s) for more efficient non-dominated sort ranking which may be O(n^2).
- [ ] use a gray code for defining neighbours for integer programming; consider the C1P problem for instance.
- [ ] could we use a hyper-volume of space dominated by a solution as a means of ranking?  There would be difficulty in having a ranking that does not penalise extrema, mind you.
- [ ] try using ~pmap~ for parallel processing, as described in [[file:~/s/notes/notes.org::*using%20pmap%20for%20parallel%20processing][note on using pmap for parallel processing]], mapping solutions to Points; alternatively, could use ~@sync @parallel for i=1,...~.  There's a note on this: [[file:~/s/notes/notes.org::*threads%20and%20parallel%20loops%20in%20Julia][threads and parallel loops in Julia]].
- [ ] use constraint information in fitness calculations
- [X] Pareto set should not include infeasible points (unless all are infeasible?)
- [X] keep Pareto set as elite
- [X] current version requires =f= to return a vector for objective function value.  A single objective function should not require this so need to catch this case.
- [X] consider splicing out the selected member from the population
- [X] parallelise the evaluation of the new members of the population
- [X] add counters to be able to display number of function evaluations etc.
- [X] allow for user specified /neighbour/ function
- [X] implement MINLP example

* notes for me (not exported)                                 :noexport:
Creating a new package: https://www.juliabloggers.com/package-development-in-julia-1-0-using-the-repl/
- *main thing* was using =dev ~/s/research/julia/Fresa.jl= command from the =Pkg= REPL.
- need to specify dependencies in the =Project.toml= file as well.  The =uuid= for each project can be found in the =~/.julia/environments/Project.toml= file.  But I don't understand how these are updated.
There's [[https://www.youtube.com/watch?v=QVmU29rCjaA][a video on developing Julia packages]].
* Overview and introduction
/Fresa/ is an implementation of a /plant propagation algorithm/ in [[http://www.julialang.org/][Julia]] programming language.  Our original version was called [[file:strawberry.org][Strawberry]], written in Octave (and usable in MATLAB).  Please see the [[file:strawberry.org][documentation]] of Strawberry for a longer description of the history of these codes, the conditions on which you may use these codes and which articles to cite.  The move to Julia is motivated by the desire to use /open source/ and /free/ (as in beer) software only while also ensuring that the tools are computationally efficient.  Octave has not kept up with developments in /just in time/ compilation and, although has some features not available in MATLAB, it is not a modern language.  Julia provides many of the capabilities of Octave while also being computationally efficient and providing many more modern features such as *built-in parallelism* and *multi-dispatch*, both of which are used by Fresa for efficiency and to make the search procedure generic with respect to data types used to represent points in the search space.

All code (either version) is copyright © {{{time(%Y)}}}, Eric S Fraga, all rights reserved.  Permission is given to use this code for evaluation purposes. The code is made available with no warranty or guarantee of any kind.  Use at own risk.  

Please let [[mailto:e.fraga@ucl.ac.uk?subject=The Fresa plant propagation algorithm][the author know]] if you download the code.  Further, if either /Fresa/ or /Strawberry/ codes are used and this use leads to publications of any type, please do cite the publications listed in the first paragraph of the documentation for [[file:strawberry.org][Strawberry]].  Feedback, including bug reports, is most welcome.

A [[http://www.ucl.ac.uk/~ucecesf/Fresa/tutorial.html][tutorial]] example, the design of the operating temperature profile for a simple reactor, modelled as a dynamic optimization problem, is available.  This example was the basis for a paper.[fn:2:E S Fraga (2019), /An example of multi-objective optimization for dynamic processes/, Chemical Engineering Transactions *74*:601-606, [[http://dx.doi.org/10.3303/CET1974101][10.3303/CET1974101]].]

** Installation
This document has been written using [[http://orgmode.org/][org mode]] in the [[https://www.gnu.org/software/emacs/][Emacs]] text editor.  Org allows for /literate programming/ and uses /tangling/ to generate the actual source files for the code.  The code, tangled from this file, can be found [[https://github.com/ericsfraga/Fresa.jl][at github]] as a Julia package.  To use this code, you should add the package using [[https://en.wikibooks.org/wiki/Introducing_Julia/Modules_and_packages][the appropriate Julia tools]].  Specifically, as =Fresa= is not listed in the main Julia registry, you have to specify where to install from.  In the Julia package manager, accessible by typing =]= at the =julia>= prompt, type

: add http://github.com/ericsfraga/Fresa.jl

to install =Fresa=.  You exit the Julia package manager by hitting your =Backspace= key.

~Fresa~ makes use of the following Julia packages: =Dates=, =Distributed=, and =Printf=.  The [[tests][test problems below]] (and found in the [[https://github.com/ericsfraga/Fresa.jl/tree/master/test][test folder on github]]) may require one or more of the following extra packages: ~BenchmarkTools~, ~PyPlot~, ~Profile~.
** Upload to web site                                        :noexport:
#+name: upload
#+begin_src shell :results none :exports none :eval never-export
  scp -r fresa.html socrates.ucl.ac.uk:html.pub
#+end_src
** Version information <<version>>
Major version log:

- March 2021 :: one of the required arguments to the =solve= function has been changed.  Specifically, the initial guess must now be a population of =Point= objects and not a single decision variable.  See [[examples][examples]] below for how to create this initial population easily.
- April 2020 :: moved all code to [[https://github.com/ericsfraga/Fresa.jl][github]].  This should make it easier for others to use the code.
- September 2019 :: The objective function values, in the ~Point~ type, are now a generic =Vector= instead of an array of floating point numbers.  This opens up *Fresa* to be used for objective functions which are not necessarily simple scalar values.  The use case has been illustrated through a case study in stochastic optimization, specifically /design under uncertainty/.  Details available from the author.
- July 2019 :: The returned values for ~Fresa.solve~ in the single objective case have changed.  Instead of separate returned values for the decision variables, the objective function value, etc., a single ~Fresa.Point~ value is returned for the best point found, along with the full final population as an array of ~Fresa.point~ values.
- June 2019 :: The calling interface for using the =Fresa.solve= method has changed.  Specifically, when the search space is defined by data structures that are not a vector of =Float64= values, the user must create a =Fresa.neighbour= function definition for the specific data structure type.
- September 2017 :: moved to an object representation for points in the search space and allowed for parallel evaluation of the objective function when multiple processors are available.
- November 2016 :: first [[http://www.julialang.org/][Julia]] plant propagation algorithm implementation.
A list [[*Recent change history][summary of recent change history]] is given below.
* TODO [0/0] improvements or bugs                            :noexport:
* Fresa – The code and documentation
:PROPERTIES:
:header-args: :tangle "src/Fresa.jl" :comments yes
:END:
# +toc: headlines 2 local
The /Fresa/ method is a population based evolutionary algorithm which mimics the propagation used by plants.  Throughout the module, the population object is an array of =Point= objects.  Each point is a point in a search space, the objective function values for this point and a feasibility indication with =g≤0= feasible and =g>0= infeasible.  See the documentation [[*solve -- use the PPA to solve the optimisation problem][for the =solve= method below]] for more details on the data structures used and expected.
** start of module and dependencies
Fresa depends on a number of packages that should be available in any Julia installation.  These are packages for displaying output and using parallel computing capabilities when available on the actual hardware.
#+name: modulestart
#+begin_src julia
  module Fresa
  version = "[2021-04-07 16:08]"
  using Dates
  using Distributed
  using Printf
  function __init__()
      if myid() == 1
          println("# -*- mode: org; eval: (org-content 3); -*-")
          println(": Fresa PPA version $version")
      end
  end
#+end_src
** types
*** Point
Fresa uses one type, =Point=, which is a point in the search space.  It includes these entries:
- ~x~ :: of indeterminate type to allow for a wide range of applications (e.g. integer versus real values),
- =z= :: the value of the objective function, as a vector, where the entries in the vector can be of any type that can be /compared/ and sorted by =sortperm= [fn:1:https://docs.julialang.org/en/v1/base/sort/index.html] or, in the case of multiple criteria, where it can be determined whether one point dominates another,
- ~g~ :: the constraint violation (feasible with ≤0 and infeasible otherwise) always of type ~Float64~ (for now), and
- ~ancestor~ :: another point in the search space that led to the creation of this point.

An instance of a point is defined by the variable in the search space, the objective function used to evaluate the point, the ancestor of this point (see below), and optional parameters to pass to that function.  

As ~Fresa~ is an evolutionary procedure, every point in the search space considered will be the descendent of a previously considered point.  The sole exception is the initial starting point given by the procedure which invokes ~Fresa~.  The link between points is through a backward chain defined by the ancestor entry.  This is not used by ~Fresa~ itself directly but provides extra meta-information that could be useful for post-optimization analysis, e.g. to see how effective the balance between exploration and exploitation may be for the given search parameter values.
#+name: pointtype
#+begin_src julia
  """

  Point (`x`) in the search space along with objective function values
  (`z[]`) and feasbility indication (`g`).  The type of `x` is problem
  specific.  `z[]` and `g` hold `Float64` values.  `g` should be of
  length 1.

  """
  struct Point
      x :: Any                    # decision point
      z :: Vector                 # objective function values
      g :: Float64                # constraint violation
      ancestor :: Union{Point,Nothing} # the parent of this point
  end
#+end_src 
Customise how a Point is displayed:
#+name: showpoint
#+begin_src julia
  import Base
  Base.show(io::IO, p::Fresa.Point) = print(io, "f(", p.x, ")=", p.z, " g=", p.g)
  # and also an array of points
  function Base.show(io::IO, p::Array{Point,1})
      np = length(p)
      if np > 0
          nz = length(p[1].z)
          println(io, "|-")
          print(io,"| x |")
          for i=1:nz
              print(io," z$(i) |")
          end
          println(io, " g |")
          println(io,"|-")
          for i=1:length(p)
              print(io, "| ", p[i].x, " |")
              for j=1:nz
                  print(io," ", p[i].z[j], " |")
              end
              print(io, " ", p[i].g, " |\n")
          end
          println(io,"|-")
      else
          print(io,"empty")
      end
  end
#+end_src 
and also indicate that a =Point= is atomic in a sense:
#+name: pointsize
#+begin_src julia
  import Base.size
  Base.size(p :: Point) = ()
#+end_src 
** COMMENT variables
These are variables that are global to the module.
#+name: variables
#+begin_src julia
  a = [0.0]                       # lower bounds
  b = [1.0]                       # upper bounds
#+end_src 
