src/Fresa.jl
# [[file:../fresa.org::modulestart][modulestart]]
module Fresa
version = "[2021-03-23 17:30]"
using Dates
using Distributed
using Printf
function __init__()
    if myid() == 1
        println("# -*- mode: org; eval: (org-content 3); -*-")
        println(": Fresa PPA version $version")
    end
end
# modulestart ends here

# [[file:../fresa.org::pointtype][pointtype]]
"""

Point (`x`) in the search space along with objective function values
(`z[]`) and feasbility indication (`g`).  The type of `x` is problem
specific.  `z[]` and `g` hold `Float64` values.  `g` should be of
length 1.

"""
struct Point
    x :: Any                    # decision point
    z :: Vector                 # objective function values
    g :: Float64                # constraint violation
    ancestor :: Union{Point,Nothing} # the parent of this point
end
# pointtype ends here

# [[file:../fresa.org::showpoint][showpoint]]
import Base
Base.show(io::IO, p::Fresa.Point) = print(io, "f(", p.x, ")=", p.z, " g=", p.g)
# and also an array of points
function Base.show(io::IO, p::Array{Point,1})
    np = length(p)
    if np > 0
        nz = length(p[1].z)
        println(io, "|-")
        print(io,"| x |")
        for i=1:nz
            print(io," z$(i) |")
        end
        println(io, " g |")
        println(io,"|-")
        for i=1:length(p)
            print(io, "| ", p[i].x, " |")
            for j=1:nz
                print(io," ", p[i].z[j], " |")
            end
            print(io, " ", p[i].g, " |\n")
        end
        println(io,"|-")
    else
        print(io,"empty")
    end
end
# showpoint ends here

# [[file:../fresa.org::pointsize][pointsize]]
import Base.size
Base.size(p :: Point) = ()
