fresa.org
** create a point
A trivial function that simply creates a new =Point= object.  This exists for two reasons:
1. It is needed for the =remotecall= functionality when using parallel computing because the =remotecall= function has to be given a function and not just a constructor (for some obscure reason that means that a constructor is transformed to a conversion operation... don't ask me).
2. The ~Point~ type is parametric.  This makes defining a generic constructor difficult (at least, I was unable to find a working solution).
The optional =parameters= and =ancestor= arguments are passed through to their respective destinations: the objective function for the parameters and the point creation for the ancestor linking.
#+name: createpoint
#+begin_src julia
  function createpoint(x,f,parameters,ancestor)
      z = 0
      g = 0
      if typeof(parameters) != Nothing
          (z, g) = f(x, parameters)
      else
          (z, g) = f(x)
      end
      if typeof(g) == Int
          g = Float64(g)
      end
      p = Nothing
      if rank(z) == 1
          p = Point(x, z, g, ancestor)
      elseif rank(z) == 0
          p = Point(x, [z], g, ancestor)
      else
          error("Fresa can only handle scalar and vector criteria, not $(typeof(z)).")
      end
      return p
  end
#+end_src 
and we provide two versions with simple calling sequences:
#+begin_src julia
  function createpoint(x,f)
      return createpoint(x,f,nothing,nothing)
  end
  function createpoint(x,f,parameters)
      return createpoint(x,f,parameters,nothing)
  end
#+end_src 
** fitness
The fitness function used depends on the number of objectives.  For single criterion problems, the fitness is the objective function values normalised and reversed so that the minimum, /i.e./ the best solution, has a fitness of close to 1 and the worst a fitness close to 0.  For multi-criteria problems, a Hadamard product of individual criteria rankings is used to create a fitness value [[http://www.springer.com/gb/ook/9783319299730][Fraga & Amusat, 2016]].

This function uses a helper function, defined below, to assign a fitness to a vector of objective function values.
#+name: fitness
#+begin_src julia
  function fitness(pop, fitnesstype)
      l = length(pop)
      indexfeasible = (1:l)[map(p->p.g,pop) .<= 0]
      indexinfeasible = (1:l)[map(p->p.g,pop) .> 0]
      # println("There are $(length(indexfeasible)) feasible entries and $(length(indexinfeasible)) infeasible")
      fit = zeros(l)
      factor = 1              # for placement in fitness interval (0,1)
      if length(indexfeasible) > 0
          feasible = view(pop,indexfeasible)
          # use objective function value(s) for ranking
          feasiblefit = vectorfitness(map(p->p.z,feasible), fitnesstype)
          if length(indexinfeasible) > 0
              feasiblefit = feasiblefit./2 .+ 0.5 # upper half of fitness interval
              factor = 2                        # have both feasible & infeasible
          end
          fit[indexfeasible] = (feasiblefit.+factor.-1)./factor
      end
      if length(indexinfeasible) > 0
          # squeeze infeasible fitness values into (0,0.5) or (0,1) depending
          # on factor, i.e. whether there are any feasible solutions as well or not
          infeasible = view(pop,indexinfeasible)
          # use constraint violation for ranking as objective function values
          # may not make any sense given that points are infeasible
          fit[indexinfeasible] = vectorfitness(map(p->p.g, infeasible), fitnesstype) / factor;
      end
      fit
  end
#+end_src 

The helper function works with a single vector of objective function values which may consist of single or multiple objectives.

#+name: vectorfitness
#+begin_src julia
  """
  For single objective problems, the fitness is simply the normalised
  objective function value.

  For multi-objective cases, there are three alternative measures of
  fitness ranking possible.  The first is based on the Hadamard product
  of the rank of each member of population accoring to each
  criterion.  The second is based on a weighted Borda ranking based on
  each criterion ranking.  Finally, a measure based on dominance,
  similar to that used by the popular NSGA-II genetic algorithm, is
  available.

  """
  function vectorfitness(v,fitnesstype)
      # determine number of objectives (or pseudo-objectives) to consider in
      # ranking
      l = length(v)
      if l == 1
          # no point in doing much as there is only one solution
          fit = [0.5]
      else
          m = length(v[1])
          # println("VF: v=$v")
          # println("  : of size $(size(v))")
          if m == 1                   # single objective 
              v = [v[i][1] for i=1:l]
              s = sortperm(v)
              zmin = v[s[1]]
              zmax = v[s[l]]
              if abs(zmax-zmin) < eps()
                  fit = 0.5*ones(l)
              else
                  # avoid extreme 0,1 values
                  fit = tanh.((zmax .- v) ./ (zmax .- zmin) .- 0.5).+0.5
              end
          else                  # multi-objective
              rank = ones(m,l); #rank of each solution for each objective function 
              if fitnesstype == :hadamard
                  for i=1:m
                      rank[i,sortperm([v[j][i] for j=1:l])] = 1:l;
                  end
                  # hadamard product of ranks
                  fitness = map(x->prod(x), rank[:,i] for i=1:l)
                  # normalise and reverse meaning (1=best, 0=worst) while avoiding
                  # extreme 0,1 values using the hyperbolic tangent
                  fit = tanh.(0.5 .- fitness ./ maximum(fitness)) .+ 0.5
              elseif fitnesstype == :borda
                  for i=1:m
                      rank[i,sortperm([v[j][i] for j=1:l])] = l:-1:1;
                  end
                  # hadamard product of ranks
                  fitness = map(x->sum(x), rank[:,i] for i=1:l)
                  # normalise (1=best, 0=worst) while avoiding
                  # extreme 0,1 values using the hyperbolic tangent
                  if (maximum(fitness)-minimum(fitness)) > eps()
                      fit = tanh.((fitness .- minimum(fitness)) / (maximum(fitness)-minimum(fitness)) .- 0.5) .+ 0.5
                  else
                      fit = 0.5*ones(l)
                  end
              elseif fitnesstype == :nondominated
                  # similar to that used by NSGA-II (Deb 2000)
                  fitness = zeros(l)
                  maxl = assigndominancefitness!(fitness,v,1)
                  # println("Resulting fitness: $fitness")
                  fit = tanh.((maxl.-fitness)./maxl .- 0.5) .+ 0.5
                  # println(":  scaled fitness: $fit")
              else
                  throw(ArgumentError("Type of fitness evaluation must be either :borda, :nondominated, or :hadamard, not $(repr(fitnesstype))."))
              end
          end
      end
      # println("VF: fit=$fit")
      fit
  end
#+end_src
The following function is used by the vector fitness evaluation to recurse through the levels of non-dominance to assign fitness based on those levels.
#+name: assigndominancefitness
#+begin_src julia
  function assigndominancefitness!(f,v,l)
      # assign value l to all members of v which dominate rest and then
      # recurse on those which are dominated
      (p, d) = paretoindices(v)
      # println("Assigning fitness $l to $p")
      f[p] .= l
      if !isempty(d)
          assigndominancefitness!(view(f,d),v[d],l+1)
      else
          l
      end
  end
#+end_src 
** neighbour -- generate random point
A random solution is generated with a distance from the original point being inversely proportional, in a stochastic sense, to the fitness of the solution.  The new point is possibly adjusted to ensure it lies within the domain defined by the lower and upper bounds.  The final argument is the fitness vector with values between 0 and 1, 1 being the most fit and 0 the least fit.

Fresa comes with two default methods for generating neighbouring solutions. The first is for a search space defined by vectors of =Float64= values:
#+name: neighbourarray
#+begin_src julia
  function neighbour(x :: Array{Float64,1},
                     a :: Array{Float64,1},
                     b :: Array{Float64,1},
                     f :: Float64
                     ) :: Array{Float64,1}
      xnew = x .+ (1.0 .- f) .* 2(rand(length(x)).-0.5) .* (b.-a)
      xnew[xnew.<a] = a[xnew.<a];
      xnew[xnew.>b] = b[xnew.>b];
      return xnew
  end
#+end_src
There is also a version that expects single valued =Float64= arguments.
#+name: neighbourfloat
#+begin_src julia
  function neighbour(x :: Float64,
                     a :: Float64,
                     b :: Float64,
                     f :: Float64
                     ) :: Float64
      # allow movements both up and down
      # in the domain for this variable
      newx = x + (b-a)*(2*rand()-1)/2.0 * (1-f)
      if newx < a
          newx = a
      elseif newx > b
          newx = b
      end
      newx
  end
#+end_src
Should other decision point types be required, e.g. mixed-integer or domain specific data structures, the =Fresa.neighbour= function with parameters of the specific type will need to be defined.  See the [[*mixed integer nonlinear example][mixed integer nonlinear example]] below for an example of a simple mixed-integer case.
