fresa.org
** pareto -- set of non-dominated points
Select a set consisting of those solutions in a population that are not dominated.  This only applies to multi-objective optimisation; for a single criterion problem, the solution with minimum objective function value would be selected.  This function is used only for returning the set of non-dominated solutions at the end of the solution procedure for multi-objective problems.  It could be used for an alternative fitness function, /a la/ Srinivas /et al./ (N Srinivas & K Deb (1995), Evolutionary Computation *2*:221-248).
*** <<<dominates>>>: determine dominance
To cater for generic comparisons between points in the objective function space (e.g. distributions instead of single values for each objective function), we introduce an operator used to determine /dominance/.  The community differs on the symbol to use for /dominates/.  Some[fn:4:https://oklahomaanalytics.com/data-science-techniques/nsga-ii-explained/] use ≼ (~\preceq~); others[fn:5:https://stackoverflow.com/questions/28406878/about-correct-notation-of-pareto-dominance-in-optimization] use ≻ (~\succ~).  I have decide to use the latter as it gives the impression of dominating.
#+name: dominates
#+begin_src julia
  function dominates(a, b)
      all(a .<= b) && any(a .< b)
  end
  ≻(a,b) = dominates(a,b)
#+end_src 
This operator will be extended by other packages that wish to make comparisons between non-scalar values of each objective function.  The easiest way may often be to ensure that \leq and < operators are defined for the individual entries in the vector of objective function values.
*** find Pareto set
The following code splits a population into those points that are non-dominated (i.e. would be considered an approximation to a Pareto frontier) and those that are dominated.  The function returns indices into the population passed to it.
#+begin_src julia
  function paretoindices(z)
      n = length(z)
      dominance = [reduce(&, [!(z[i] ≻ z[j]) for i ∈ 1:n]) for j ∈ 1:n]
      paretoindices = filter(j -> dominance[j], 1:n)
      dominatedindices = filter(j -> !dominance[j], 1:n)
      (paretoindices, dominatedindices)
  end
#+end_src 
*************** test                                         :noexport:
#+begin_src julia :tangle no
  using Fresa
  include("Fresa.jl")
  nx = 2
  a = zeros(nx)
  b = ones(nx)
  x = rand(nx)
  f = x -> ( [sin(x[1]-x[2]); cos(x[1]+x[2])], 0)
  pop = Fresa.Point[]
  for i=1:10
      push!(pop, Fresa.createpoint(Fresa.randompoint(a,b), f))
  end
  z = map(p->p.z, pop)
  # (p, d) = Fresa.paretoindices(z)
  (p, d) = Fresa.pareto(pop)
#+end_src 
*************** END

Given a population of ~Point~ objects, this function identifies those that are non-dominated (see above).  If the population includes both feasible and infeasible points, only those that are feasible are considered.
#+name: pareto
#+begin_src julia
  # indices of non-dominated and dominated points from the population of
  # Point objects
  function pareto(pop :: Vector{Point})
      l = length(pop)
      indexfeasible = (1:l)[map(p->p.g,pop) .<= 0]
      indexinfeasible = (1:l)[map(p->p.g,pop) .> 0]
      if length(indexfeasible) > 0
          subset = view(pop,indexfeasible)
          indices = indexfeasible
      else
          println(": Fresa.pareto warning: no feasible solutions.  Pareto set meaningless?")
          subset = pop
          indices = 1:l
      end
      z = map(p->p.z, subset)
      # use function below to return indices of non-dominated and
      # dominated from objective function values alone in the subset of
      # feasible solutions
      (p, d) = paretoindices(z)
      (indices[p], indices[d])
  end
#+end_src
*** COMMENT deprecated code
#+begin_src julia
  # *DEPRECATED*
  #
  # see new paretoindices function above
  #
  # set of non-dominated (and dominated) points from array of objective
  # function values alone.
  function pareto(z::Array{Array{Float64,1},1})
      l = length(z)
      p = Int[]                 # indices of pareto members in full population
      d = Int[]                 # indices for dominated members
      for i in 1:l
          dominated = false
          for j in 1:l
              if i != j
                  if all(z[i] .>= z[j]) && any(z[i] .> z[j])
                      # println("$i dominated by $j")
                      # println("$(z[:,i]) >= $(z[:,j])")
                      dominated = true;
                      break;
                  end
              end
          end
          # println("member $(pop[i]) is dominated: $dominated")
          if dominated
              push!(d,i)          # dominated
          else
              push!(p,i)          # pareto, i.e. non-dominated
          end
      end
      (p, d)
  end
#+end_src
** prune - control population diversity
Due to the stochastic nature of the method and also the likely duplication of points when elitism is used, there is a need to prune the population.  We wish to remove members that have objective function values (or alternatively decision variable values) that are too close to each other.  The main difficulty is the definition of /too close/.  We use a tolerance based on the range of values present in the population for the objective function pruning and the tolerance directly for decision variable pruning.

Previously, pruning was done on objective function values.  In the case where that is not possible (e.g. cannot find difference of values), we consider the decision variables as well.  The latter assume that we have a -(subtraction) operator for the decision variable type; if not, we do no pruning at all.
#+name: prune
#+begin_src julia
  function prune(pop :: AbstractArray, tolerance)
      npruned = 0
      z = map(p->p.z, pop)
      # println("typeof(z)=$(typeof(z))")
      l = length(z)
      # println("typeof(z[1])=$(typeof(z[1]))")
      n = length(z[1])
      zmin = zeros(n)
      zmax = zeros(n)
      try 
          for i=1:n
              row = [z[j][i] for j=1:l]
              zmin[i] = minimum(row)
              zmax[i] = maximum(row)
              if zmax[i] - zmin[i] < 100*eps()
                  zmax[i] = zmin[i]+100*eps()
              end
          end
          pruned = [pop[1]]
          for i=2:l
              similar = false
              for j=1:length(pruned)
                  if all(abs.(z[i]-pruned[j].z) .< tolerance*(zmax-zmin))
                      similar = true;
                      break;
                  end
              end
              if !similar
                  push!(pruned,pop[i])
              else
                  npruned += 1
              end
          end
          (pruned, npruned)
      catch e
          if isa(e, MethodError)
              # probably (possibly) due to objective function type not
              # being a number.  In this case, we try again but looking
              # at the decision variable values instead.
              x = map(p->p.x, pop)
              # println("typeof(z)=$(typeof(z))")
              l = length(x)
              # start building up the population that remains after
              # pruning.  The first entry will always be there as any
              # similar solutions will not be included by the search
              # that follows.
              pruned = [pop[1]]
              try
                  for i=2:l
                      similar = false
                      # now check this solution against all those already in
                      # the list we are collating
                      for j=1:length(pruned)
                          if all(Float64.(abs.(x[i]-pruned[j].x)) .< tolerance)
                              similar = true;
                              break;
                          end
                      end
                      if !similar
                          push!(pruned,pop[i])
                      else
                          npruned += 1
                      end
                  end
                  (pruned, npruned)        
              catch e
                  if isa(e, MethodError)
                      # this is now probably/possibly due to not being
                      # to find the difference between two decision
                      # points.  In that case, return the whole
                      # original population
                      (pop, 0)
                  end
              end
          end
      end
  end
#+end_src 
** randompopulation -- for testing other methods
Create a random population of size ~n~ evaluated using ~f~.
#+name: randompopulation
#+begin_src julia
  function randompopulation(n,f,parameters,a,b)
      p = Point[]                 # population object
      for j in 1:n
          push!(p, createpoint(randompoint(a,b), f, parameters))
      end
      p
  end
#+end_src 
By default, the following method generates a random point within the search domain.  This does not attempt to find a feasible point, simply one within the box defined by lower, =a=, and upper, =b=, bounds.  
#+name: randompoint
#+begin_src julia
  function randompoint(a,b)
      x = a + rand(length(a)).*b
  end
#+end_src 
** select -- choose a member of the population
Given a fitness, ~f~, choose two solutions randomly and select the one with the better fitness.  This is known as a /tournament/ selection procedure of size 2.  Other options are possible but not currently implemented.
#+name: select
#+begin_src julia
  function select(f)
      l = length(f)
      ind1 = rand(1:l)
      if ind1 == 0
          ind1 = 1
      end
      ind2 = rand(1:l)
      # println("Comparing $ind1 to $ind2")
      if f[ind1] > f[ind2]
          return ind1
      else
          return ind2
      end
  end
#+end_src 
** COMMENT set bounds -- for real valued decision vectors
Used to set some of the module global variables used by many of the functions in the module.  This could have been done in the main ~solve~ function but was taken out to make testing of small parts of the module easier.
#+name: setbounds
#+begin_src julia
  function setbounds(lower,upper)
      global a = lower;
      global b = upper;
      global n = length(lower);
      # println("Size of problem: $n")
  end
#+end_src
