fresa.org
** solve -- use the PPA to solve the optimisation problem
The function expects the objective function, ~f~, an initial guess, ~x0~, and lower, ~a~, and upper, ~b~, bounds.  It returns the optimum, the objective function value(s) at this point, the constraint at that point and the whole population at the end.  The actual return values and data structures depends on the number of criteria:
- 1 :: returns best point as a ~Fresa.Point~ object (which includes the decision variable values, the objective function value, and the constraint value) and also the full population;
- >1 :: returns the set of non-dominated points (as an array including objective function values and constraint value) and the full population.
     
The objective function, =f=, should return two results: =z=, the objective function value(s) which must be of type =Float64=, single or array, and =g=, the constraint violation.  If =g≤0=, the point is feasible; any value =g>0= means an infeasible point.  The value of =g= for infeasible points will be used to rank the fitness of the infeasible solution, with lower values being fitter.

The calling sequence for =f= is a point in the search space plus, optionally, the =parameters= defined in the call to =solve=.

=x0= is the initial guess and can be of any type.  =a= and =b= are lower and upper bounds and should be of types consistent with each other and =x0=.

If the decision vector is not an array of =Float64=, a type specific =Fresa.neighbour= function will need to be defined.  The calling sequence for =Fresa.neighbour= is =(x,a,b,fitness)= where =x=, =a=, and =b=, should all be of the desired type and the function itself must also return an object of that type.  The =fitness= will always be a =Float64=.  See the [[*mixed integer nonlinear example][mixed integer nonlinear example]] below for an example.

The =fitnesstype= is used for ranking members of a population for multi-objective problems.  The default is to use a Hadamard product of the rank each solution has for each objective individually.  One alternative, specifying ~fitnesstype=:borda~ uses a sum of the rank, i.e. a Borda count.  The former tends to emphasise points near the extrema of the individual criteria while the latter is possibly better distributed but possibly at providing less emphasis on the Pareto points themselves.  There is also the option ~fitnesstype=:nondominated~ which bases the fitness on levels of dominance, as used by the =NSGA-II= genetic algorithm.

The size of the population, =npop=, may be a single integer value or a =Tuple= of two integer values.  The latter, which is only for multi-objective optimization problems, gives a range of possible values for the population size.  This size will be chosen dynamically within this range depending on the size of the non-dominated set at the start of each generation.  Specifically, the population will be set to 2 times that size.  This allows for sufficient diversity in the population while minimizing computation time.  It has been seen that Fresa is largely insensitive to the population size: there is [[https://www.youtube.com/watch?v=kfDrQhhswLk][an interesting video]] by Marleen de Jonge & Daan van den Berg discussing the robustness of the plant propagation algorithm with respect to the parameters for the algorithm, using a slightly different version of the algorithm which does not use tournament selection but instead selects the top =npop= members of the population for propagation.

The output of progress during the search is controlled by the ~output~ optional argument.  This should be an integer value that indicates how often a summary of the current population is generated and sent to standard output.  The default is 5 for every 5th generation.  A value of 0 will eliminate all output from the solve method.
#+name: solve
#+begin_src julia
  """ 

  Solve an optimisation problem, defined as the minimization of the
  values returned by the objective function, `f`.  `f` returns not only
  the objective function values, an array of `Float64` values, but also
  a measure of feasibility (≤0) or infeasibility (>0).  The problem is
  solved using the Fresa algorithm.  `p0` is the initial population
  which has to have at least one member, a `Point`, and `a` and `b` are
  ,*bounds* on the search space.

  The return values for the solution of a single criterion problem are
  the best point and the full population at the end of the search. 

  For a multi-objective problem, the returned values are the set of
  indices for the points within the full population (the second returned
  value) approximating the *Pareto* front.

  The population will consist of an array of `Fresa.Point` objects, each
  of which will have the point in the search space, the objective
  function value and the feasibility measure.

  """
  function solve(f, p0, a, b;     # required arguments
                 parameters = nothing, # allow parameters for objective function 
                 archiveelite = false,  # save thinned out elite members
                 elite = true,    # elitism by default
                 fitnesstype = :hadamard, # how to rank solutions in multi-objective case
                 ngen = 100,      # number of generations
                 npop = 10,       # population size: fixed (single value) or dynamic (tuple)
                 nrmax = 5,       # number of runners maximum
                 ns = 100,        # number of stable solutions for stopping
                 output = 5,      # how often to output information
                 plotvectors = false, # generate output file for search plot
                 tolerance = 0.001, # tolerance for similarity detection
                 usemultiproc = false) # parallel processing by Fresa itself?
      output != 0 && println("** solve $f $(orgtimestamp(now()))")
      tstart = time()
      nf = 1                   # number of function evaluations
      npruned = 0              # number solutions pruned from population
      nz = length(p0[1].z)     # number of criteria
      pop = copy(p0);          # create/initialise the population object
      if archiveelite
          archive = Point[]
      end
      if output != 0
          println("#+name: $(f)settings")
          println("| variable | value |")
          println("|-")
          println("| ngen | $ngen |")
          println("| npop | $npop |")
          println("| nrmax | $nrmax |")
          println("| ns | $ns |")
          println("| elite | $elite |")
          println("| archive | $archiveelite |")
          println("| fitness | $fitnesstype |")
          println("|-")
          # output != 0 && println(": solving with ngen=$ngen npop=$npop nrmax=$nrmax ns=$ns")
          # output != 0 && println(": elite=$elite archive elite=$archiveelite fitness type=$fitnesstype")
      end
      if plotvectors
          plotvectorio = open("fresa-vectors-$(orgtimestamp(now())).data", create=true, write=true)
          output != 0 && println(": output of vectors for subsequent plotting")
      end
      # if npop was given as a tuple, we are to have a dynamic
      # population size.  This only makes sense for multi-objective
      # optimization problems so a warning will be given otherwise.
      npopmin = npop
      npopmax = npop
      if isa(npop, Tuple)
          if nz > 1
              npopmin = npop[1]
              npopmax = npop[2]
              if npopmin > npopmax
                  error("Dynamic population sizing requires min <= max; you specified $npop")
              end
              npop = npopmin      # start with minimum possible
          else
              println("*Warning*: you have specified a tuple for population size: $npop")
              println("This only makes sense for multi-objective optimization problems.")
              println("npop will be set to $(npop[1]).")
              npop = npop[1]      # be optimistic and use minimum given
          end
      end
      # we use parallel computing if we have more than one processor
      parallel = usemultiproc && nprocs() > 1
      # parallel = false
      if output != 0
          println(": function evaluations performed ",
                  parallel ? "in parallel with $(nprocs()) processors." : "sequentially.")
          println("*** initial population")
          println("#+name: $(f)initial")
          println(pop)
      end
      if parallel
          # will be used to collect results from worker processors
          results = Array{Future,1}(undef, nprocs())
      end
      if output != 0
          println("*** evolution")
          println("#+name: $(f)evolution")
          @printf("| %9s | %9s | %9s | %9s | %9s |", "gen", "npop",
                  (elite && nz > 1) ? "pareto" : "nf", "pruned", "t (s)")
          for i in 1:nz
              @printf(" z%-8d |", i)
          end
          @printf(" %9s |", "g")
          @printf("\n|-\n")
      end
      # now evolve the population for a predetermined number of generations
      for gen in 1:ngen
          # evaluate fitness
          fit = fitness(pop, fitnesstype)
          # sort
          index = sortperm(fit)
          # and remember best which really only makes sense in single
          # criterion problems but is best in multi-objective case in
          # the ranking measure used by Fresa
          best = pop[index[end]]
          # if elitism is used
          if elite
              if nz > 1
                  # elite set is whole pareto set unless it is too
                  # big. Recall that the pareto function returns the set
                  # of indices into the population
                  wholepareto = pareto(pop)[1]
                  # if using dynamic population sizing, adjust the population
                  npop = 2 * length(wholepareto)
                  if npop < npopmin
                      npop = npopmin
                  end
                  if npop > npopmax
                      npop = npopmax
                  end
                  # now check that the pareto is not too big.  if it is, thin it out
                  if length(wholepareto) > ceil(npop/2)
                      newpop, removed = thinout(pop, fit, wholepareto, ceil(Int,npop/2))
                      if archiveelite
                          archive = prune(append!(archive, removed), tolerance)[1]
                          archive = archive[pareto(archive)[1]]
                      end
                  else
                      newpop = pop[wholepareto]
                  end
              else
                  # elite set is single element only
                  newpop = [best]
              end
              # if plotting vectors for the search, include elitism
              if plotvectors
                  for p in newpop
                      write(plotvectorio, "$(gen-1) $(p.x)\n$gen $(p.x)\n\n")
                  end
              end
          else
              newpop = Point[]
          end
          print(stderr, ": $gen np=$(length(newpop))/$npop",
                archiveelite ? " na=$(length(archive))" : "",
                " with most fit z=$(best.z)           \r")
          if output != 0 && gen%output == 0
              @printf("| %9d | %9d | %9d | %9d | %9.2f |", gen, length(fit),
                      (elite && nz > 1) ? length(newpop) : nf, npruned, time()-tstart)
              for i = 1:length(best.z)
                  print(" $(best.z[i]) |")
              end
              print(" $(best.g) |")
              println()
          end
          if parallel
              # create array to store all new points; we evaluate them
              # later hopefully in parallel.  Also keep track of the
              # points from which new points are derived to provide the
              # backward link through the evolution
              x = typeof(newpop[1].x)[]
              points = Point[]
          end
          # now loop through population, applying selection and then
          # generating neighbours
          l = length(pop)
          for i in 1:min(l,npop)
              s = select(fit)
              # println(": selection $i is $s")
              # println(": size of pop is $(size(pop))")
              selected = pop[s]
              if !elite
                  # if no elitism, we ensure selected members remain in population
                  push!(newpop, selected)
                  if plotvectors
                      write(plotvectorio, "$(gen-1) $(selected.x)\n$gen $(selected.x)\n\n")
                  end
              end
              # number of runners to generate, function of fitness
              nr = ceil(fit[s]*nrmax*rand())
              if nr < 1
                  nr = 1
              end
              # println(": generating $nr runners")
              for r in 1:nr
                  # create a neighbour, also function of fitness
                  newx = neighbour(pop[s].x,a,b,fit[s])
                  # for parallel evaluation, we store the neighbours and
                  # evaluate them later; otherwise, we evaluate
                  # immediately and save the resulting point
                  if parallel
                      push!(x, newx)
                      push!(points, pop[s])
                  else
                      push!(newpop, createpoint(newx, f, parameters, pop[s]))
                      if plotvectors
                          write(plotvectorio, "$(gen-1) $(pop[s].x)\n$gen $newx\n\n")
                      end
                      nf += 1
                  end
              end
              # remove selected member from the original population so
              # it is not selected again
              splice!(fit, s)
              splice!(pop, s)
          end
          # if we are making use of parallel computing, we evaluate all
          # points generated in previous loop.  
          if parallel
              i = 0;
              while i < length(x)
                  # issue remote evaluation call
                  for j=1:nprocs()
                      if i+j <= length(x) 
                          results[j] = @spawn createpoint(x[i+j],f,parameters,
                                                          points[i+j])
                          nf += 1
                      end
                  end
                  # now wait for results
                  for j=1:nprocs()
                      if i+j <= length(x)
                          push!(newpop, fetch(results[j]))
                      end
                  end
                  i += nprocs()
              end
          end
          # and finally, if we have elitism, remove any duplicate points
          # in the new population and make it the current population for
          # the next generation; otherwise, simply copy over
          if elite
              (pop, nn) = prune(newpop, tolerance)
              npruned += nn
          else
              pop = newpop
          end
      end
      output != 0 && println("*** Fresa run finished\n: nf=$nf npruned=$npruned", archiveelite ? " archived=$(length(archive))" : "")
      if plotvectors
          close(plotvectorio)
      end
      if nz == 1
          fit = fitness(pop, fitnesstype)
          index = sortperm(fit)
          best = pop[index[end]]
          return best, pop
      else
          return pareto(archiveelite ? append!(pop,archive) : pop)[1], pop
      end
  end
#+end_src 
